<?php

class ControllerEmpresas{
    //___________________________________________________________________________________________________________
    // controller método que permite mostrar una empresa
    public static function controllerMostrarEmpresa(){
        // código...
    }
    //___________________________________________________________________________________________________________

    //___________________________________________________________________________________________________________
    // controller método que permite ingresar una empresa
    public static function controllerRegistrarEmpresa(){
        // código...
    }
    //___________________________________________________________________________________________________________

    //___________________________________________________________________________________________________________
    // controller método que permite editar una empresa
    public static function controllerEditarEmpresa(){
        // código...
    }
    //___________________________________________________________________________________________________________

    //___________________________________________________________________________________________________________
    // controller método que permite eliminar una empresa
    public static function controllerEliminarEmpresa(){
        // código...
    }
    //___________________________________________________________________________________________________________
}