<?php

class ControllerProyectos{
    //___________________________________________________________________________________________________________
    // controller método que permite mostrar proyecto
    public static function controllerMostrarProyecto(){
        // código...
    }
    //___________________________________________________________________________________________________________

    //___________________________________________________________________________________________________________
    // controller método que permite ingresar un proyecto
    public static function controllerRegistrarProyecto(){
        // código...
    }
    //___________________________________________________________________________________________________________

    //___________________________________________________________________________________________________________
    // controller método que permite editar un proyecto
    public static function controllerEditarProyecto(){
        // código...
    }
    //___________________________________________________________________________________________________________

    //___________________________________________________________________________________________________________
    // controller método que permite eliminar un proyecto
    public static function controllerEliminarProyecto(){
        // código...
    }
    //___________________________________________________________________________________________________________
}